{
  "\n": 21,
  " ": 0,
  "!": 24,
  "$": 42,
  ".": 51,
  "/": 41,
  "0": 26,
  "1": 27,
  "2": 29,
  "3": 36,
  "4": 39,
  "5": 37,
  "6": 33,
  "7": 40,
  "8": 45,
  "9": 44,
  "?": 30,
  "@": 53,
  "[": 85,
  "\\": 225,
  "]": 96,
  "`": 234,
  "a": 3,
  "b": 19,
  "c": 14,
  "d": 11,
  "e": 1,
  "f": 20,
  "g": 15,
  "h": 10,
  "i": 5,
  "j": 25,
  "k": 23,
  "l": 9,
  "m": 13,
  "n": 6,
  "o": 4,
  "p": 17,
  "q": 38,
  "r": 7,
  "s": 8,
  "t": 2,
  "u": 12,
  "v": 22,
  "w": 18,
  "x": 28,
  "y": 16,
  "z": 31,
  "{": 110,
  "}": 133,
  "~": 56,
  "\u00a3": 103,
  "\u00ab": 124,
  "\u00ae": 126,
  "\u00b4": 226,
  "\u00ba": 106,
  "\u00bb": 91,
  "\u00e1": 270,
  "\u00e2": 194,
  "\u00e8": 151,
  "\u00e9": 67,
  "\u00ed": 266,
  "\u00f1": 256,
  "\u00f3": 171,
  "\u00f8": 255,
  "\u00fa": 195,
  "\u011f": 191,
  "\u0131": 108,
  "\u013a": 249,
  "\u014d": 152,
  "\u05d3": 213,
  "\u05d6": 208,
  "\u05d7": 207,
  "\u05d9": 157,
  "\u05dd": 210,
  "\u05de": 212,
  "\u05e7": 209,
  "\u05ea": 211,
  "\u1ec5": 193,
  "\u200e": 246,
  "\u200f": 252,
  "\u2013": 47,
  "\u2014": 46,
  "\u2015": 121,
  "\u2018": 50,
  "\u2019": 32,
  "\u201c": 34,
  "\u201d": 35,
  "\u2022": 72,
  "\u2026": 43,
  "\u2032": 233,
  "\u203c": 94,
  "\u20ac": 232,
  "\u2194": 199,
  "\u25cf": 240,
  "\u2600": 140,
  "\u2601": 228,
  "\u2605": 88,
  "\u2606": 206,
  "\u2609": 235,
  "\u2611": 60,
  "\u2618": 263,
  "\u261d": 165,
  "\u261e": 162,
  "\u2639": 192,
  "\u263a": 90,
  "\u2661": 68,
  "\u2665": 136,
  "\u26a1": 259,
  "\u26be": 132,
  "\u2705": 64,
  "\u2708": 154,
  "\u270a": 156,
  "\u270c": 257,
  "\u2714": 84,
  "\u2728": 219,
  "\u274c": 58,
  "\u2764": 57,
  "\u27a1": 55,
  "\u2b05": 313,
  "\u2b07": 109,
  "\u3001": 71,
  "\u3002": 100,
  "\u300a": 258,
  "\u300c": 298,
  "\u300d": 305,
  "\u3042": 168,
  "\u3044": 115,
  "\u3046": 139,
  "\u304a": 337,
  "\u304c": 114,
  "\u304d": 181,
  "\u304e": 325,
  "\u304f": 183,
  "\u3052": 310,
  "\u3053": 180,
  "\u3054": 250,
  "\u3055": 296,
  "\u3056": 251,
  "\u3057": 77,
  "\u3059": 116,
  "\u305b": 297,
  "\u305d": 333,
  "\u305f": 118,
  "\u3066": 188,
  "\u3067": 120,
  "\u3068": 87,
  "\u306a": 101,
  "\u306b": 75,
  "\u306e": 99,
  "\u306f": 146,
  "\u307e": 97,
  "\u307f": 281,
  "\u3081": 299,
  "\u3084": 287,
  "\u3088": 182,
  "\u308a": 113,
  "\u308b": 102,
  "\u3092": 89,
  "\u30a2": 189,
  "\u30b8": 334,
  "\u30b9": 303,
  "\u30c0": 275,
  "\u30c8": 117,
  "\u30c9": 187,
  "\u30ca": 331,
  "\u30d5": 272,
  "\u30d7": 143,
  "\u30d9": 302,
  "\u30e9": 141,
  "\u30ea": 274,
  "\u30eb": 332,
  "\u30ed": 273,
  "\u30f3": 142,
  "\u4e00": 295,
  "\u4e0a": 309,
  "\u4e16": 327,
  "\u4eca": 282,
  "\u4f1a": 175,
  "\u521d": 317,
  "\u5230": 276,
  "\u529f": 336,
  "\u5317": 284,
  "\u534a": 283,
  "\u53d6": 308,
  "\u53f2": 318,
  "\u540c": 322,
  "\u554f": 147,
  "\u5584": 301,
  "\u5927": 98,
  "\u5c3d": 304,
  "\u5e38": 289,
  "\u5f53": 330,
  "\u6210": 335,
  "\u62c9": 307,
  "\u63fa": 324,
  "\u65e5": 119,
  "\u65e9": 278,
  "\u6700": 300,
  "\u671d": 177,
  "\u672c": 148,
  "\u6765": 306,
  "\u6b74": 185,
  "\u70b9": 292,
  "\u754c": 328,
  "\u7684": 319,
  "\u76df": 323,
  "\u7740": 277,
  "\u793a": 329,
  "\u7948": 338,
  "\u7c73": 184,
  "\u7d46": 326,
  "\u7d71": 144,
  "\u8133": 174,
  "\u81e8": 280,
  "\u81f4": 179,
  "\u8981": 291,
  "\u8a2a": 186,
  "\u8a8d": 293,
  "\u8ac7": 176,
  "\u8b58": 294,
  "\u8cbb": 286,
  "\u901f": 279,
  "\u9055": 321,
  "\u91cd": 290,
  "\u9593": 320,
  "\u975e": 288,
  "\u9818": 145,
  "\u984c": 178,
  "\u9996": 173,
  "\u9bae": 285,
  "\ufe0f": 52,
  "\uff52": 229,
  "\uff54": 230,
  "\ud83c\udde6": 169,
  "\ud83c\udde8": 138,
  "\ud83c\uddea": 130,
  "\ud83c\uddeb": 159,
  "\ud83c\uddee": 95,
  "\ud83c\uddef": 82,
  "\ud83c\uddf0": 131,
  "\ud83c\uddf1": 128,
  "\ud83c\uddf2": 248,
  "\ud83c\uddf3": 220,
  "\ud83c\uddf4": 172,
  "\ud83c\uddf5": 62,
  "\ud83c\uddf7": 70,
  "\ud83c\uddf8": 48,
  "\ud83c\uddfa": 49,
  "\ud83c\uddfb": 254,
  "\ud83c\udf0d": 161,
  "\ud83c\udf0f": 269,
  "\ud83c\udf39": 221,
  "\ud83c\udf51": 205,
  "\ud83c\udf88": 262,
  "\ud83c\udf89": 125,
  "\ud83c\udfa5": 61,
  "\ud83c\udfa7": 238,
  "\ud83c\udfc6": 155,
  "\ud83c\udfc8": 239,
  "\ud83c\udfe2": 214,
  "\ud83c\udfeb": 215,
  "\ud83c\udffb": 76,
  "\ud83c\udffc": 265,
  "\ud83c\udffd": 261,
  "\ud83d\udc18": 164,
  "\ud83d\udc40": 247,
  "\ud83d\udc46": 260,
  "\ud83d\udc49": 264,
  "\ud83d\udc4a": 93,
  "\ud83d\udc4b": 134,
  "\ud83d\udc4c": 66,
  "\ud83d\udc4d": 54,
  "\ud83d\udc4e": 218,
  "\ud83d\udc4f": 81,
  "\ud83d\udc51": 137,
  "\ud83d\udc54": 243,
  "\ud83d\udc57": 242,
  "\ud83d\udc5a": 244,
  "\ud83d\udc62": 245,
  "\ud83d\udc7f": 160,
  "\ud83d\udc81": 224,
  "\ud83d\udc83": 167,
  "\ud83d\udc8b": 222,
  "\ud83d\udc94": 150,
  "\ud83d\udc95": 112,
  "\ud83d\udc97": 80,
  "\ud83d\udc9a": 201,
  "\ud83d\udc9c": 166,
  "\ud83d\udc9e": 197,
  "\ud83d\udca5": 237,
  "\ud83d\udca6": 204,
  "\ud83d\udca8": 122,
  "\ud83d\udcaa": 170,
  "\ud83d\udcaf": 63,
  "\ud83d\udcb0": 135,
  "\ud83d\udcc8": 65,
  "\ud83d\udcc9": 311,
  "\ud83d\udcf7": 315,
  "\ud83d\udcf8": 92,
  "\ud83d\udcfa": 202,
  "\ud83d\udd05": 268,
  "\ud83d\udd25": 163,
  "\ud83d\uddfd": 267,
  "\ud83d\ude01": 129,
  "\ud83d\ude02": 74,
  "\ud83d\ude03": 253,
  "\ud83d\ude04": 83,
  "\ud83d\ude05": 314,
  "\ud83d\ude06": 198,
  "\ud83d\ude07": 227,
  "\ud83d\ude09": 127,
  "\ud83d\ude0a": 79,
  "\ud83d\ude0d": 73,
  "\ud83d\ude0e": 312,
  "\ud83d\ude11": 123,
  "\ud83d\ude12": 149,
  "\ud83d\ude14": 203,
  "\ud83d\ude18": 86,
  "\ud83d\ude1c": 190,
  "\ud83d\ude1d": 200,
  "\ud83d\ude21": 196,
  "\ud83d\ude22": 107,
  "\ud83d\ude23": 236,
  "\ud83d\ude29": 316,
  "\ud83d\ude2c": 111,
  "\ud83d\ude30": 271,
  "\ud83d\ude31": 158,
  "\ud83d\ude33": 104,
  "\ud83d\ude45": 105,
  "\ud83d\ude4c": 59,
  "\ud83d\ude4f": 69,
  "\ud83d\ude80": 223,
  "\ud83d\ude82": 78,
  "\ud83d\udea8": 153,
  "\ud83e\udd14": 216,
  "\ud83e\udd16": 217,
  "\ud83e\udd83": 241,
  "\udbff\udc00": 231
}